blog-posts/2005-05-12-hipster-pda-gtd-tiddly-wiki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Hipster PDA: GTD Tiddly Wiki</title>
<!-- 2014-04-30 Wed 17:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Hipster PDA: GTD Tiddly Wiki</h1>
<p>
May 12th, 2005 -
<a href="http://sachachua.com/blog/p/2760"><a href="http://sachachua.com/blog/p/2760">http://sachachua.com/blog/p/2760</a></a>
</p>

<p>
Miguel Javier said:
</p>

<blockquote>
<p>
GTD Tiddly Wiki is a GettingThingsDone adaptation of JeremyRuston's
 Open Source TiddlyWiki. The purpose of GTD Tiddly Wiki is to give
 users a single repository for their GTD lists and support materials
so
 they can create/edit lists, and then print directly to 3×5 cards for
 use with the HipsterPDA.
</p>

<p>
<a href="http://shared.snapgrid.com/gtd_tiddlywiki.html"><a href="http://shared.snapgrid.com/gtd\_tiddlywiki.html">http://shared.snapgrid.com/gtd\_tiddlywiki.html</a></a>
</p>
</blockquote>

<p>
No kidding. I wonder what we should do to get Planner to support 3×5
 index cards sanely&#x2026;
</p>

<p>
E-Mail from Miguel Javier
</p>

<p>
ÃƒÂ¥Ã‚Â½Ã‚Â¼ÃƒÂ¥Ã‚Â¥Ã‚Â³ÃƒÂ£Ã‚Â?Ã‚Â¯ÃƒÂ¥Ã‚Â¨Ã‚Â˜ÃƒÂ£Ã‚Â?Ã‚Â«ÃƒÂ£Ã‚ÂƒÃ‚Â‘ÃƒÂ£Ã‚Â‚Ã‚Â½ÃƒÂ£Ã‚Â‚Ã‚Â³ÃƒÂ£Ã‚ÂƒÃ‚Â³ÃƒÂ£Ã‚Â‚Ã‚Â'ÃƒÂ¨Ã‚Â²Ã‚Â·ÃƒÂ£Ã‚Â?Ã‚Â£ÃƒÂ£Ã‚Â?Ã‚Â¦ÃƒÂ£Ã‚Â‚Ã‚Â„ÃƒÂ£Ã‚Â?Ã‚Â£ÃƒÂ£Ã‚Â?Ã‚ÂŸÃƒÂ£Ã‚Â€Ã‚Â‚
She got her daughter a personal computer.
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/wiki">wiki</a>,
<a href="http://www.technorati.com/tag/gtd">gtd</a>,
<a href="http://www.technorati.com/tag/hipster">hipster</a>,
<a href="http://www.technorati.com/tag/hipsterpda">hipsterpda</a>,
<a href="http://www.technorati.com/tag/productivity">productivity</a>,
<a href="http://www.technorati.com/tag/organizer">organizer</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
